/*
Задачи

от Саши
   Балансировка строки со скобками+ '*' символ служит любой скобкой или пустой строкой 
   Строка может содержать три символа '()*'. Нужно удостоверится что у каждой открывающей скобки есть закрывающая + '*' может быть любой скобкой или пустой строкой 

от Андрея
1   развернуть слова в строке "I am a programmer" -> "programmer a am I"

2   и найти уникальный елемент в неотсортированом масиве или вернуть что-то что будет значить что его нет например optional

3   когда-то давно еще просили написать бинарное дерево и релизовать find и insert

https://leetcode.com/problems/longest-substring-without-repeating-characters/

*/


